#+TITLE: Chapter 1 Exercises
#+DESCRIPTION: Mathematical Methods in Engineering, Karman and Biot
#+AUTHOR: Jason Ross
#+OPTIONS: toc:nil num:t
#+DATE: 2020-01-09

#+CONTEXT_HEADER: \usemodule[pret-python]
#+CONTEXT_HEADER_EXTRA: \setupdescription[orgdesc][headstyle=bold, style=normal, align=flushleft, alternative=hanging, width=broad, margin=1cm]

* Problem 1
  - Problem :: Evaluate numerically the integral

  \[
  I = \int_0^{\pi/2}{\ln\left(\sin{x}\right) dx}
  \]

  and compare with the exact value $I = -\frac{\pi}{2}\ln{2}$

  - Solution :: ...

    Note that $\ln{\left(\sin x\right)} = \ln{\left(x \frac{\sin x}{x}\right)}
    = \ln{x} + \ln{\frac{\sin x}{x}}$

    Therefore we just need to find
    $\int_0^{\pi/2}{\ln{x} dx}$ analytically and evaluate
    $\int_0^{\pi/2}{\ln{\frac{\sin x}{x}} dx}$ numerically.

    $\int_0^{\pi/2}{\ln{x} dx}$ can be integrated by parts.

    Let $u = \ln x, v^{'} = dx, u^{'} = \frac{1}{x}, v = x$. Therefore,
    $$\int{ln{x} dx} = \int{u v^{'} dx} = u v - \int{v u^{'} dx}$$
    $$ u v - \int{v u^{'} dx} = x \ln x - \int{x \frac{1}{x} dx} = x \ln x - x$$
    And so, $\int_0^{\pi/2}{\ln x dx} = \left. x \ln x - x \right|_0^{\pi/2}$
    \begin{align*}
    \lim_{x \to 0} x \ln x &= \lim_{x \to 0} \frac{\ln x}{\frac{1}{x}}\\
    &= \lim_{x \to 0}-\frac{\frac{1}{x}}{\frac{1}{x^2}}\\
    &= \lim_{x \to 0}-x\\
    &= 0
    \end{align*}
    And, =$\int_0^{\pi/2}{\ln x dx} = \frac{pi}{2} \left(\ln x - 1\right) \approx -0.861$

    #+BEGIN_SRC python :results output code :exports both
    from sympy import log, pi, integrate
    from sympy.abc import x
    print((pi/2 * (log(pi/2) - 1)).evalf())
    print(integrate(log(x), (x, 0, pi/2)).evalf())
    #+END_SRC

    #+RESULTS:
    #+begin_src python
    -0.861451872082119
    -0.861451872082119
    #+end_src

    So we have a value for part of our problem. The other part is to evaluate the integral
    $$\int_0^{\pi/2}{\ln{\frac{\sin x}{x}} dx}$$
    We can do this with Simpson's rule. Recall that
    \[S = \frac{H}{9}\sum_{i=0}^{n-1}{f(x_0 + i H)+
    4 f\left(x_0 + \left(i + \frac{1}{2}\right) H\right) +
    f\left(x_0 + \left(i + 1\right) H\right)}\]
    
    #+BEGIN_SRC python :results output :exports both
    from math import pi, sin, log
    num_points = 10000
    xmin = 0
    xmax = pi/2
    def f(x):
        if x == 0:
            return 0
        return log(sin(x)/x)
    H = (xmax - xmin) / num_points
    def s(x0, i, H, f):
        return H/6 * (
            f(x0 + i * H) 
            + 4 * f(x0 + (i + 1/2) * H) 
            + f(x0 + (i + 1) * H)
        ) 
    print(sum(s(xmin, i, H, f) for i in range(num_points)))
    #+END_SRC
    
    #+RESULTS:
    : -0.2273057071559435
    
    #+BEGIN_SRC python :results file :exports both
    import matplotlib.pyplot as plt
    import numpy as np
    from math import pi, log, sin
    xmin = 0
    xmax = pi/2
    def f(x):
        if x == 0:
            return 0
        return log(sin(x)/x)
    X = np.linspace(xmin, xmax)
    Y = [f(x) for x in X]
    plt.plot(X, Y)
    fname = "myfig.pdf"
    plt.savefig(fname)
    return fname
    #+END_SRC
    
    #+RESULTS:
    [[file:myfig.pdf]]

* Problem 2
  - Problem Statement :: 
    Evaluate numerically the integral $\int_1^2{\frac{dx}{x}}$. Use Simpson's rule with
    an interval $h = 0.1$.
  - Solution :: ...
    #+BEGIN_SRC python :results output :exports both
      from math import log
      import numpy as np
      xmin = 1
      xmax = 2
      h = 0.1
      def f(x):
          return 1/x
      def s(x, h, f):
          return h/3 * (f(x) + 4 * f(x + h) + f(x + 2 * h))
      print(sum(s(x, h, f) for x in np.arange(xmin, xmax - 2 * h, 2 * h)))
    #+END_SRC
    
    #+RESULTS:
    : 0.587789606907254

* Problem 3
  - Problem Statement :: Integrate numerically the differential equation
    \[\frac{dy}{dx} = y\]
    with the initial condition $y = 1$ for $x = 0$. Use Adams' method with
    $h = 1$ in the range from $x = 0$ to $x = 1$.
  - Solution :: ...

    Applying Adams' method, we first compute the Taylor's expansion of the solution
    in the vicinity of $x = 0$. The first derivative is 
    \[\frac{dy}{dx} = y\]
    The second derivative is found by differentiating with respect to $x$:
    \[\frac{d^2y}{dx^2} = \frac{dy}{dx} = y\]
    Differentiating again,
    \[\frac{d^3y}{dx^3} = \frac{d^2y}{dx^2} = y\]
    \[\frac{d^4y}{dx^4} = \frac{d^3y}{dx^3} = y\]
    Using the values of these derivatives at $y=1, x=0$, we find the Taylor's expansion
    \[y = 1 + x + \frac{x^2}{2!} + \frac{x^3}{3!} + \frac{x^4}{4!}\]

    #+NAME: adams
    #+BEGIN_SRC python :session adams :output
      def func(x, x0, y0, d0, d1, d2, d3, d4):
          return (
              d0(x0, y0)
              + d1(x0, y0) * (x - x0)
              + d2(x0, y0) * (x - x0)**2 / 2
              + d3(x0, y0) * (x - x0)**3 / 6
              + d4(x0, y0) * (x - x0)**4 / 24
          )
      def get_deltas(l):
          return [lr - ll for lr, ll in zip(l[1:], l[:-1])]
      def get_next_y(y, h, q0, q1, q2, q3, q4):
          return y + h * (q0 + 1/2 * q1 + 5/12 * q2 * 3/8 * q3 + 251/720 * q4)
      epsilon = 1e-10
      def get_values(x0, y0, xmax, h, d0, d1, d2, d3, d4):
          initial_x_vals = [x0 + i * h for i in range(5)]
          initial_y_vals = [func(x, x0, y0, d0, d1, d2, d3, d4) for x in initial_x_vals]
          initial_qs = [d1(x, y) for x, y in zip(initial_x_vals, initial_y_vals)]
          x = initial_x_vals[-1]
          qs = initial_qs
          y_vals = initial_y_vals
          x_vals = initial_x_vals
          while x < xmax - epsilon:
              x += h
              x_vals.append(x)
              dqs = get_deltas(qs)
              ddqs = get_deltas(dqs)
              dddqs = get_deltas(ddqs)
              ddddqs = get_deltas(dddqs)
              next_y = get_next_y(
                  y_vals[-1],
                  h,
                  qs[-1],
                  dqs[-1],
                  ddqs[-1],
                  dddqs[-1],
                  ddddqs[-1]
              )
              qs.append(d1(x, next_y))
      y_vals.append(next_y)
          return y_vals
    #+end_src

    #+results: adams
    now that we've defined a function for adams' method, we can reuse it.

    #+begin_src python :session adams :results output :exports both
      def d0(x, y):
          return y
      def d1(x, y):
          return y
      def d2(x, y):
          return y
      def d3(x, y):
          return y
      def d4(x, y):
          return y
      x0 = 0
      y0 = 1
      h = 0.1
      xmax = 1
      print(*[
          f"{y:.3f}" for y in get_values(x0, y0, xmax, h, d0, d1, d2, d3, d4)
      ])
    #+end_src

    #+results:
    : 1.000 1.105 1.221 1.350 1.492 1.648 1.821 2.011 2.222 2.455 2.712


* Problem 4
  - Problem Statement :: integrate numerically the differential equation
    \[\frac{d^2 y}{dx^2} - x y = 0 \] in the interval between $x = 0$ and $x =
    1$ with the initial conditions $y = 1$ and $\frac{dy}{dx} = 0$ for $x = 0$

  - Solution :: introduce a new unknown variable $u$ by the transformation \[u =
    \frac{1}{y}\frac{dy}{dx}\] or \[u = \frac{d}{dx}\left(\ln y \right)\]
    calculate and substitute $\frac{d^2 y}{dx^2}$; show that the above
    differential equation becomes $\frac{du}{dx} + u^2 - x = 0$ and integrate
    using adams' method using $h = 0.1$.
     \begin{align*}
    \frac{du}{dx} &= -\frac{1}{y^2}\left(\frac{dy}{dx}\right)^2 + \frac{1}{y}\frac{d^2 y}{dx^2} \\
    \frac{d^2 y}{dx^2} &= y \frac{du}{dx} + \frac{1}{y} \left( \frac{dy}{dx} \right)^2 \\
    \frac{d^2 y}{dx^2} - xy &= y \frac{du}{dx} + \frac{1}{y} \left( \frac{dy}{dx} \right)^2 - x y = 0 \\
    \frac{du}{dx} + \left( \frac{1}{y} \frac{dy}{dx} \right)^2 - x &= 0 \\
    \frac{du}{dx} + u^2 - x &= 0
    \end{align*}
    we need to calculate derivatives of $u$ for use in the taylor's series:
    \begin{align*}
    \frac{du}{dx} &= x - u^2 \\
    \frac{d^2 u}{dx^2} &= 1 - 2 u \frac{du}{dx} \\
    &= 1 - 2 x u + 2 u^3 \\
    \frac{d^3 u}{dx^3} &= 2 u + 2 x \frac{du}{dx} + 6 u^2 \frac{du}{dx} \\
    &= 2 u + 2 x^2 - 2 x u^2 + 6 x u^2 - 6 u^4 \\
    &= 2 x^2 + 2 u + 4 x u^2 - 6 u^4 \\
    \frac{d^4}{dx^4} &= 4 x + 2 \frac{du}{dx}
    + 4 u^2 + 8 x u \frac{du}{dx} - 24 u^3 \frac{du}{dx} \\
    &= 4 x + 2 x - 2 u^2 + 4 u^2 + 8 x^2 u - 8 x u^3 - 24 x u^3 + 24 u^5 \\
    &= 6 x + 8 x^2 u + 2 u^2 -32 x u^3 + 24 u^5
    \end{align*}

    #+begin_src python :session adams :results output :exports both
      def d0(x, y):
          return y
      def d1(x, y):
          return x - y**2
      def d2(x, y):
          return 1 - 2 * x * y + 2 * y**3
      def d3(x, y):
          return 2 * x**2 + 2 * y + 4 * x * y**2 - 6 * y**4
      def d4(x, y):
          return 6 * x + 8 * x**2 * y + 2 * y**2 - 32 * x * y**3 + 24 * y**5
      x0 = 0
      y0 = 0
      h = 0.1
      xmax = 1
      u_vals = get_values(x0, y0, xmax, h, d0, d1, d2, d3, d4)
      print(*[
          f"{y:.3f}" for y in u_vals
      ], sep=",")
    #+end_src

    #+results:
    : 0.000,0.005,0.020,0.045,0.080,0.124,0.177,0.238,0.306,0.380,0.458

    let's plot the vector field to get a idea if this is reasonable.


    #+begin_src python :results file :exports both
      import matplotlib.pyplot as plt
      import numpy as np
      x, y = np.meshgrid(np.linspace(0, 1, 25), np.linspace(0, 1, 25))
      def slope(x, y):
          return x - y**2
      u = np.ones_like(x)
      v = slope(x, y)
      plt.figure(figsize=(8, 8))
      plt.quiver(x, y, u, v, scale=30)
      plt.gcf().tight_layout()
      plt.plot( np.linspace(0, 1, 11),
                [0.000,0.005,0.020,0.045,0.080,0.124,0.177,0.238,0.306,0.380,0.458] )
      plt.savefig("temp.pdf")
      return "temp.pdf"

    #+end_src

    #+results:
    [[file:temp.pdf]]

    it remains to apply quadrature to the solution to convert back into a
    differential equation in terms of $y$

